Revit 2027 API
RectangleLightShape(Double, Double) Constructor
 Creates a rectangle light shape object with the given emit length and width.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RectangleLightShape(
	double emitLength,
	double emitWidth
)
Public Sub New (
	emitLength As Double,
	emitWidth As Double
)
public:
RectangleLightShape(
	double emitLength,
	double emitWidth
)
new :
        emitLength : float *
        emitWidth : float -> RectangleLightShape
Parameters
emitLength Double
 The emit length as a numerical value in feet between 1.0e-9 and 30000.0
emitWidth Double
 The emit width as a numerical value in feet between 1.0e-9 and 30000.0
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
See Also
Reference
RectangleLightShape Class
RectangleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace